Revit 2026 API

# LinkLoadResult(LinkLoadResult) Constructor

---

Constructs a new copy of the input LinkLoadResult object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LinkLoadResult(
	LinkLoadResult other
)
```
```vb
Public Sub New (
	other As LinkLoadResult
)
```
```cpp
public:
LinkLoadResult(
	LinkLoadResult^ other
)
```
```fsharp
new :
        other : LinkLoadResult -> LinkLoadResult
```

#### Parameters

other LinkLoadResult

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LinkLoadResult Class

LinkLoadResult Overload

Autodesk.Revit.DB Namespace